/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "main-page",
      "settings": {
        "show_title": true,
        "page_width": "narrow"
      }
    },
    "faq_section": {
      "type": "collapsible-tabs",
      "blocks": {
        "faq_1": {
          "type": "question",
          "settings": {
            "title": "How long does pottery take to make?",
            "answer": "<p>Each piece goes through several stages: throwing on the wheel (30-60 minutes), drying (1-2 weeks), bisque firing (24 hours), glazing (1-2 hours), and final firing (24 hours). From start to finish, each piece takes about 3-4 weeks.</p>"
          }
        },
        "faq_2": {
          "type": "question",
          "settings": {
            "title": "Are your pieces food safe?",
            "answer": "<p>Yes! All functional pieces are fired to stoneware temperatures (cone 6, approximately 2232°F) and glazed with food-safe glazes. They're dishwasher, microwave, and oven safe up to 400°F.</p>"
          }
        },
        "faq_3": {
          "type": "question",
          "settings": {
            "title": "Do you take custom orders?",
            "answer": "<p>Absolutely! I love creating custom pieces. Lead time is typically 4-6 weeks depending on complexity and my current kiln schedule. A 50% deposit is required to begin work. Visit my Custom Orders page for more details.</p>"
          }
        },
        "faq_4": {
          "type": "question",
          "settings": {
            "title": "How often do you fire your kiln?",
            "answer": "<p>I typically fire 1-2 times per month, depending on how quickly I fill the kiln. Each kiln load contains 50-70 pieces. I announce new firings through my newsletter and social media.</p>"
          }
        },
        "faq_5": {
          "type": "question",
          "settings": {
            "title": "What clay do you use?",
            "answer": "<p>I primarily work with stoneware clay bodies that are durable and food-safe when fired. The clay comes from reputable suppliers and is mixed specifically for throwing and functional pottery.</p>"
          }
        },
        "faq_6": {
          "type": "question",
          "settings": {
            "title": "Do you offer pottery classes?",
            "answer": "<p>Currently, I'm focused on production work, but I'm considering offering workshops in the future. Follow my newsletter or social media for updates on any classes I might offer.</p>"
          }
        },
        "faq_7": {
          "type": "question",
          "settings": {
            "title": "How do you ship fragile pottery?",
            "answer": "<p>Each piece is carefully wrapped in bubble wrap and packed with plenty of cushioning material. I use sturdy boxes and mark them as fragile. I also offer local pickup in the Lake Stevens area.</p>"
          }
        },
        "faq_8": {
          "type": "question",
          "settings": {
            "title": "What's your return policy?",
            "answer": "<p>Due to the handmade nature of ceramics, I don't accept returns unless the item arrives damaged. Please inspect your order immediately upon arrival and contact me within 48 hours if there are any issues.</p>"
          }
        }
      },
      "block_order": [
        "faq_1",
        "faq_2",
        "faq_3",
        "faq_4",
        "faq_5",
        "faq_6",
        "faq_7",
        "faq_8"
      ],
      "settings": {
        "title": "Frequently Asked Questions"
      }
    }
  },
  "order": [
    "main",
    "faq_section"
  ]
}
