/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "main-page",
      "settings": {
        "show_title": true,
        "page_width": "narrow"
      }
    },
    "faq_section": {
      "type": "collapsible-tabs",
      "blocks": {
        "faq_1": {
          "type": "collapsible_tab",
          "settings": {
            "title": "How many pieces do you make each month?",
            "content": "<p>I produce about 50-70 pieces per month in my Lake Stevens studio. Each piece is hand-thrown and finished individually, ensuring quality and uniqueness. I fire my kiln once or twice monthly, depending on the season and my production schedule.</p>"
          }
        },
        "faq_2": {
          "type": "collapsible_tab",
          "settings": {
            "title": "Are your pieces food safe and dishwasher safe?",
            "content": "<p>Yes! All my functional pottery is made with food-safe glazes and fired to stoneware temperatures (over 2000°F). They're safe for dishwasher, microwave, and oven use. I recommend hand washing for decorative pieces to preserve their beauty.</p>"
          }
        },
        "faq_3": {
          "type": "collapsible_tab",
          "settings": {
            "title": "What if a piece arrives damaged?",
            "content": "<p>I pack each piece carefully with bubble wrap and padding, but accidents can happen. If your pottery arrives damaged, please email me photos within 48 hours and I'll send a replacement or full refund. Your satisfaction is my priority.</p>"
          }
        },
        "faq_4": {
          "type": "collapsible_tab",
          "settings": {
            "title": "Do you take custom orders?",
            "content": "<p>Yes! I love creating custom pieces. Custom orders typically take 4-6 weeks from design approval to completion. This includes the full cycle of throwing, drying, glazing, and firing. A 50% deposit is required to begin work.</p>"
          }
        },
        "faq_5": {
          "type": "collapsible_tab",
          "settings": {
            "title": "How should I care for my pottery?",
            "content": "<p>Hand washing is recommended for longevity, though dishwasher use is fine. Avoid sudden temperature changes (don't put hot pieces in cold water). Store carefully to prevent chips. With proper care, your pottery will last for generations.</p>"
          }
        },
        "faq_6": {
          "type": "collapsible_tab",
          "settings": {
            "title": "When will you restock sold-out items?",
            "content": "<p>Each piece is unique, so exact restocks aren't possible. However, I create similar pieces in each kiln load. If you see something you love, I recommend purchasing it - it may be weeks or months before I create something similar.</p>"
          }
        },
        "faq_7": {
          "type": "collapsible_tab",
          "settings": {
            "title": "Do you offer local pickup?",
            "content": "<p>Yes! I'm located in Lake Stevens, WA, and local pickup is available by appointment. This saves on shipping costs and lets you see the pieces in person. Contact me to arrange a pickup time.</p>"
          }
        },
        "faq_8": {
          "type": "collapsible_tab",
          "settings": {
            "title": "What glazes do you use?",
            "content": "<p>I use a variety of glazes that I've developed over years of experimentation. My signature glazes include earth tones, sage greens, and warm browns. All glazes are lead-free and food safe. Each firing can produce slight variations in color.</p>"
          }
        }
      },
      "block_order": [
        "faq_1",
        "faq_2",
        "faq_3",
        "faq_4",
        "faq_5",
        "faq_6",
        "faq_7",
        "faq_8"
      ],
      "settings": {
        "title": "Frequently Asked Questions",
        "color_scheme": "1"
      }
    }
  },
  "order": [
    "main",
    "faq_section"
  ]
}
